import { CustomLayout } from "@/components/CustomLayout";
import { Breadcrumbs } from "@/components/Breadcrumbs";

export default function About() {
  return (
    <CustomLayout breadcrumbs={()=><Breadcrumbs title="Про нас" />} >
      <div className="max-w-7xl mx-auto px-4">
        <div className="py-12">
          <h2 className="text-3xl font-bold mb-4">Про нас</h2>
          <p className="mb-4">
            Ласкаво просимо до нашої компанії! Ми спеціалізуємося на оренді високоякісного електроінструменту для різноманітних потреб. Наша мета - забезпечити вас найкращими інструментами для виконання ваших проектів.
          </p>
          <p className="mb-4">
            Ми пропонуємо широкий вибір інструментів, включаючи дрилі, шуруповерти, болгарки, перфоратори та багато іншого. Всі наші інструменти проходять регулярне технічне обслуговування, щоб гарантувати їх надійність і ефективність.
          </p>
          <p className="mb-4">
            Наша команда професіоналів завжди готова допомогти вам з вибором інструменту, надати консультації та підтримку. Ми прагнемо забезпечити найкращий сервіс для наших клієнтів і зробити процес оренди максимально зручним і простим.
          </p>
          <p className="mb-4">
            Дякуємо, що обрали нас для ваших потреб в електроінструменті. Ми з нетерпінням чекаємо можливості співпраці з вами!
          </p>
        </div>
      </div>
    </CustomLayout>
  );
}
